# (name="Okurmen")  вот такие параметры называются -> формальными
# (a, b, c) а обычные –> фактическими

# 1 - тапшырма
"""
check_password деген функция жазыныздар,
ал биринчи параметр катары бир сап(строка), 
и экинчиге бир формальный параметр кабыл алат
ал по умолчанию барабар болсун '$%!?@#' ушул символдорго.
Функция текшериш керек, эгер жазылган парольдун 
ичинде ушул символдордун бири болсо жана узундугу 8 ден чон болсо
True болбосо False кайтарыш керек
"""

# 2 - тапшырма
"""
get_rect_value еген функция жазыныздар,
ал озуно 2 параметр алсын(ширина, дилина)
анан дагы бир формальный параметр tp деген
болсун, по умолчанию ал True мааниге ээ.
Эгер tp барабар болсо True'га,
анда торт бурчтуктун периметрин,
болбосо аянтын чыграныздар
"""