# (name="Okurmen")  вот такие параметры называются -> формальными
# (a, b, c) а обычные –> фактическими

# 1 - тапшырма
"""
check_password деген функция жазыныздар,
ал биринчи параметр катары бир сап(строка), 
и экинчиге бир формальный параметр кабыл алат
ал по умолчанию барабар болсун '$%!?@#' ушул символдорго.
Функция текшериш керек, эгер жазылган парольдун 
ичинде ушул символдордун бири болсо жана узундугу 8 ден чон болсо
True болбосо False кайтарыш керек
"""

# 2 - тапшырма
"""
get_rect_value еген функция жазыныздар,
ал озуно 2 параметр алсын(ширина, дилина)
анан дагы бир формальный параметр tp деген
болсун, по умолчанию ал True мааниге ээ.
Эгер tp барабар болсо True'га,
анда торт бурчтуктун периметрин,
болбосо аянтын чыграныздар
"""


morze = {'a': '•—', 'b': '—•••', 'c': '—•—•', 'd': '—••',   
         'e': '•', 'f': '••—•', 'g': '——•', 'h': '••••',
         'i': '••', 'j': '•———', 'k': '—•—', 'l': '•—••',
         'm': '——', 'n': '—•', 'o': '———', 'p': '•——•',
         'q': '——•—', 'r': '•—•', 's': '•••', 't': '—',
         'u': '••—', 'v': '•••—', 'w': '•——', 'x': '—••—',
         'y': '—•——', 'z': '——••'}                # собственно, словарь перевода текста в код

text = input().lower().split()    # Houston we have a problem
text = '\n'.join(text)
print(text)                       # проверочный принт - каждое слово на отдельной строке                 

for i in text:
    for key, value in morze.items():
        if i==key:
            print(value, end=' ')   # однако в итоге получаем код одной строчкой
