# 1 - тапшырма
'''
Бизге консольдон область аттары берилет,
аларды генерациянын жардамы менен узундугу 5 тен 
чон область аттарын чыгарыныздар
Мисалы:
Чуй Талас Нарын Ысык-Кол Ош Баткен
Жооп:
Талас Нарын Ысык-Кол Баткен
'''

# names = [i for i in input().split()]
# list_names = []
# for name in names:
#     if len(name) >= 5:
#         list_names.append(name)
# print(list_names)

# print([name for name in input().split() if len(name) >= 5])


# 2 - тапшырма
'''
Бизге консольдон узундуктары бирдей болгон
эки массив киргизилет.
Генерация жардамы менен башка бир листке ал эки
массивдин озуно тиешелуу жуптарынын суммасын чыгарыныздар
Мисалы:
1 2 3 4 5
6 7 8 9 10
Жоопко:
7 9 11 13 15

Тушундурмо:
биричи массив = 1  2  3  4  5
экинчи массив = 6  7  8  9  10
башка массив  = 7  9 11 13  15
биринчи массив менен экинчи массивдин 
индекси туура келген элементерин кошуп 
башка массивге жаздык
'''
list_1 = [i for i in input().split()]
list_2 = [i for i in input().split()]
print([int(list_1[i]) + int(list_2[i]) for i in range(len(list_1))])


