# 1 - тапшырма
"""
Функция жазыныздар ал параметр катары бир  *args алсын,
функция бизге кайтарып берсин бир гана жуп санадарды.
Сандарды биз озубуз консольдон киргизебиз!
Функциянын аты get_even босун!
"""


# 2 - тапшырма
"""
Функция жазыныздар ал параметр катары бир  *args алсын,
функцияга биз аргумент катары шаардын аттарын беребиз.
Функция кайтарып бериш керек, аты эн узун шаар атын,
эгерде узундугу бирдей болгон шаарлар бир нече болсо,
анда эн биринчи берилген шаарды чыгарыныздар!
Функциянын аты get_biggest_city болсун!
Мисалы:
Bishkek Osh Talas Batken Stambul
Жоопко:
Bishkek
"""