# 1 - Тапшырма
'''
Консольдон биз создоруду жазабыз жана ал создорду 
ар бир сапка чыгарыныздар
'''

# 2 - Тапшырма
'''
Бизге ФИО киргизебиз, жоопко баш тамгаларды чыгарыныз
Мисалы:
Кенжегулов Арсен Кенжегулович
жооп:
К.А.К деп чыгыш керек
'''

# 3 - Тапшырма
'''
Биз консольдон 4 сан ортосу чекит 
менен ажыратылган текст(ip address) киргизебиз
(192.168.0.3)

Биз текшеришибиз керек ошол ip адрес туура жазылганын
Эскертүү. Эгерде бардык 4 сан 0 дон 255 ке чейин болсо, IP адрес туура болот.
Мисалы:
192.168.0.3 деп киргизсек
жоопко:
Yes

192.168.0.300 деп киргизсек
жоопко:
No
'''

# 4 - Тапшырма
'''
numbers = [8, 9, 10, 11]
Берилген кодду төмөнкүдөй кылып толтуруңуз:

    тизменин экинчи элементин 17 менен алмаштырыныз;
    Тизменин аягына 4, 5 жана 6 сандарын кошунуз;
    Тизменин биринчи элементин алып салыныз;
    3 индекске 25 санын кошунуз;
    print() функциясын колдонуп тизмени басып чыгарыныз
'''