# 1 - тапшырма (2 балл)
message = "Leaning is fun"
'''
Жогорудагы суйломдон индекси так болгон тамгаларды чыгарыныздар
'''

# 2 - тапшырма (2 балл)
message = "Pyhton is cool"
'''
Жогорудагы суйломду тескери чыгарыныздар
'''

# 3 - тапшырма (2 балл)
message = "I am from Bishkek"
'''
Жогорудагы суйломдон акыркы 2 символдон жана биринчи 3 символдон
башка бардык символдорду чыгарынзыдар
'''

# 4 - тапшырма (2 балл)
name = input('Enter your name: ')
city = input('Enter your city: ')
'''
Бизге консольдон name жана city берилет.
"My name is <name> and I live in <city>." 
деп чыгарарыныздар, f-строкасын колдонуу менен.
'''

# 5 - тапшырма (2 балл)

text = input("Enter some text: ")
'''
Биринчи, биз киргизген текстин үчүнчү символун чыгарыңыз.

Экинчи, биз киргизген текстин акыркы белгисин басып чыгарыңыз.

Үчүнчү, биз киргизген текстин биринчи беш белгисин басып чыгарыңыз.

Төртүнчү, биз киргизген текстин акыркы эки символдон башка бут сабын чыгарыңыз.

Бешинчи, биз киргизген текстин ичинен жуп индекстеги символдорду басып чыгарыңыз (индекстоо 0 дон башталат).

Алтынчы, биз киргизген текстин бардык символдорун тескери тартипте чыгарыңыз.
'''


