# 1 - тапшырма
'''
Бизге консольдон область аттары берилет,
аларды генерациянын жардамы менен узундугу 5 тен 
чон область аттарын чыгарыныздар
Мисалы:
Чуй Талас Нарын Ысык-Кол Ош Баткен
Жооп:
Талас Нарын Ысык-Кол Баткен
'''
# 2 - тапшырма
'''
Бизге консольдон узундуктары бирдей болгон
эки массив киргизилет.
Генерация жардамы менен башка бир листке ал эки
массивдин озуно тиешелуу жуптарынын суммасын чыгарыныздар
Мисалы:
1 2 3 4 5
6 7 8 9 10
Жоопко:
7 9 11 13 15

Тушундурмо:
биричи массив = 1  2  3  4  5
экинчи массив = 6  7  8  9  10
башка массив  = 7  9 11 13  15
биринчи массив менен экинчи массивдин 
индекси туура келген элементерин кошуп 
башка массивге жаздык
'''


