# 1 - Тапшырма(1 балл)
num1 = input("Enter first number: ")
num2 = input("Enter second number: ")

'''
Консольдон эки санды строка(str) катары алып,
алардын бутун(int) санга айландырып, суммасын чыгарып бериниз
'''

# 2 - Тапшырма(2 балл)
user_input = input("Enter some string: ")
'''
Консольдон бир строканы(str) сураган программаны жазыңыз,
андан кийин ал сапты жалан чоң, жалан кичине жана баш тамгалар менен чыгарыңыз.
'''

# 3 - Тапшырма(3 балл)
user_input = input("Enter some string: ")
'''
Консольдон бир текст киргизебиз 
жана анын ал текст жалан тамгалардан, 
сандардан же баш тамгалар(чон тамгалардан) экенин текшериңиз.
'''


# 4 - Тапшырма(4 балл)
text = input("Введите строку: ")
search_word = input("Введите слово для поиска: ")
replace_word = input("Введите слово для замены: ")

'''
Консольдон бир текст, 
андан кийин издей турган сөздү жана 
алмаштырылуучу созду киргизебиз. 
Жоопко ошол текстин ичинен изделген созду 
алмаштырыла тургана созго алмаштыруу керек
Мисал:
text = "I know you are trying really hard to learn Python."
search_word = "Python"
replace_word = "Java Script"
Жооп -> "I know you are trying really hard to learn Java Script."
'''


# Кошумча тапшырма
date_of_birth = input("Enter date of birth (DD.MM.YYYY): ")

'''
Консольдон туулган кунубузду DD.MM.YYYY форматында киргизебиз,
Жоопко чыгыш керек:
    “Сиз [жыл] жылдын [ай] айынын [кун] кунундо торолгонсуз.
Мисалы:
    date_of_birth = "14.03.2002"
    жоопко -> "Сиз 2002 жылдын 03 айынын 14 кунундо торолгонсуз"
'''

