# 1 - тапшырма (2 балл)
message = "Leaning is fun"
'''
Жогорудагы суйломдон индекси так болгон тамгаларды чыгарыныздар
'''

# 2 - тапшырма (2 балл)
message = "Pyhton is cool"
'''
Жогорудагы суйломду тескери чыгарыныздар
'''

# 3 - тапшырма (2 балл)
message = "I am from Bishkek"
'''
Жогорудагы суйломдон акыркы 2 символдон жана биринчи 3 символдон
башка бардык символдорду чыгарынзыдар
'''

# 4 - тапшырма (2 балл)
name = input('Enter your name: ')
city = input('Enter your city: ')
'''
Бизге консольдон name жана city берилет.
"My name is <name> and I live in <city>." 
деп чыгарарыныздар, f-строкасын колдонуу менен.
'''

# 5 - тапшырма (2 балл)

text = input("Enter some text: ")
'''
Биринчи сапка берилген саптын үчүнчү символун чыгарыңыз.

Экинчи сапта берилген саптын акыркы белгисин басып чыгарыңыз.

Үчүнчү сапта берилген саптын биринчи беш белгисин басып чыгарыңыз.

Төртүнчү сапта акыркы эки белгиден башка бүт сапты басып чыгарыңыз.

Бешинчи сапта бардык символдорду жуп индекстери менен басып чыгарыңыз (индекстоо 0 дон башталат).

Алтынчы сапта так индекстери бар бардык символдорду, башкача айтканда саптын экинчи символунан баштап басып чыгарыңыз.

Жетинчи сапта бардык символдорду тескери тартипте басып чыгарыңыз.
'''


