# 1 - тапшырма (2 балл)
message = "Leaning is fun" # enn sfn
'''
Жогорудагы суйломдон индекси так болгон тамгаларды чыгарыныздар
'''
tak_tamgalar = message[1::2]
print(tak_tamgalar)

# 2 - тапшырма (2 балл)
message = "Pyhton is cool"
'''
Жогорудагы суйломду тескери чыгарыныздар
'''
print(message[::-1])


# 3 - тапшырма (2 балл)
message = "I am from Bishkek" # m from Bishk
'''
Жогорудагы суйломдон акыркы 2 символдон жана биринчи 3 символдон
башка бардык символдорду чыгарынзыдар
'''
print(message[3:-2])


# 4 - тапшырма (2 балл)
name = input('Enter your name: ')
city = input('Enter your city: ')
'''
Бизге консольдон name жана city берилет.
"My name is <name> and I live in <city>." 
деп чыгарарыныздар, f-строкасын колдонуу менен.
'''
print(f"My name is {name} and I live in {city}.")


# 5 - тапшырма (2 балл)

text = input("Enter some text: ") # I live in Osh
'''
Биринчи, биз киргизген текстин үчүнчү символун чыгарыңыз.

Экинчи, биз киргизген текстин акыркы белгисин басып чыгарыңыз.

Үчүнчү, биз киргизген текстин биринчи беш белгисин басып чыгарыңыз.

Төртүнчү, биз киргизген текстин акыркы эки символдон башка бут сабын чыгарыңыз.

Бешинчи, биз киргизген текстин ичинен жуп индекстеги символдорду басып чыгарыңыз (индекстоо 0 дон башталат).

Алтынчы, биз киргизген текстин бардык символдорун тескери тартипте чыгарыңыз.
'''
print("Учунчу символ:",  text[2])
print(text[-1])
print(text[:5])
print(text[:-2])
print(text[::2])
print(text[::-1])