"""
Тапшырма 1: Тизменин уникалдуу элементтерин сорттоо

Программага бүтүн сандардын тизмеси берилет.
Биринчилерден уникалдуу элементтерди табып
жана сорттоп чыгарыныздар.
"""
# print(sorted({int(i) for i in input().split()}))


"""
Тапшырма 2: 

Программага бүтүн сандардын тизмеси берилет. 
Бардык элементтердин суммасын эсептеп, 
сумма ар бир элементке бөлүнүп жатканын текшериниздер.
Эгер баарына болунсо True болбосо False чыгарынзыдар!
"""
numbers = map(int, input().split())
print(all(map(lambda x: sum(numbers) % x == 0, numbers)))