# 1 - Тапшырма
'''Биз консольдон бир сан киргизебиз(n деген сан болсун).
Жоопко [1,2,3,..., n] чыгарыш керек
''' 

# 2 - Тапшырма
'''Биз консольдон бир сан киргизебиз(n деген сан болсун).
Англис тамгаларын катары менен n тамгасын чыгарыныз

Мисалы:
n = 10 болсо, анда жоопко 
['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'] ушунтип чыгыш керек
'''

# 3 - Тапшырма
'''
evens = [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
ушул элементтердин орточо суммасын табыныздар(среднее арифметическое)
'''

# 4 - Тапшырма
'''
rainbow = ['Red', 'Orange', 'Yellow', 'Green', 'Blue', 'Indigo', 'Violet']
ушул листтин ичинен Green барабар болгон созду Жашыл деген созго жана
Red деген созду Кызыл деген созго алмаштырып жоопту консольго чыгарыныздар
'''