# 1 - тапшырма 
'''
Таблица(Жадыбал)

Биз консольдон бир сан киргизебиз (1 ден 10 го чейинки сандар)
Анан ошол сандын таблицасын чыгарыш керек

Мисалы:
>>> 4 деп киргизсем

4 x 1 = 4
4 x 2 = 8
4 x 3 = 12
4 x 4 = 16
4 x 5 = 20
4 x 6 = 24
4 x 7 = 28
4 x 8 = 32
4 x 9 = 36
4 x 10 = 40

ушундай жадыбал чыгарыныздар!
'''

# 2 - Тапшырма
'''
Биз консольго бир сан киргизебиз(ал сан 2 ден чон болуш керек)

кайра жоопко
жылдызчалардан турган уч бурчтук чыгарыш керек

Мисалы:
3
*
**
***

10
*
**
***
****
*****
******
*******
********
*********
**********

ушундай болуш керек
'''