# 1 - Тапшырма
'''
Бизге n деген сан берилет консольдон,
консольго чыгарыш керек n*n форматындагы массивди 
ар бир индекстин квадыратын.
Мисалы:
n = 3
1  4  9
16 25 36
49 64 81
ушинтип чыгыш керек
'''

# 2 - Тапшырма
'''
Фибоначчи сандары
0,1,1,2,3,5,8,13,21,34,55,...
мында биринчи эки сан (0 мене 1) 
жана ар бир кийинки сан мурунку 
эки сандын суммасына барабар болот.

Бизге n деген сан берилет консольдон,
жоопко n чи Фибоначчи санын чыгарыныз.
Мисалы:
n = 7
Жетинчи Фибоначчи саны 8 барабар болгондуктан
жоопко 8 деп чыгыш керек
'''
