'''
Пароль

Сайтка катталып жатканда парольду эки жолу киргизишибиз керек.
Бул коопсуздук максатында жасалат, анткени бул ыкма парольду туура 
эмес киргизуу мумкунчулугун азайтат.

Парольдорду салыштыруучу программа жазыңыз.
Эгерде алар дал келсе, анда программа "Пароль кабыл алынды",
болбосо: "Пароль кабыл алынган жок." деп чыгарышы керек

Киргизуу форматы
Программага киргизуу катары эки сап берилет.

Чыгуу форматы
Программа тапшырманын шартына ылайык бир сап чыгарышы керек.
'''

password_1 = input("Парольду жазыныз: ")
password_2 = input("Кайталап жазыныз: ")